## boolean

In [1]:
True==False

False

In [2]:
True!=0

True

In [3]:
False==0

True

In [5]:
True or False

True

In [73]:
1=='1'

False

In [103]:
a=True and False
a

False

In [97]:
a=False and True
a

False

## 문자열

In [9]:
eng='korea COVID 19'

In [13]:
eng.lower()

'korea covid 19'

In [104]:
eng.upper()

'KOREA COVID 19'

In [202]:
eng.lower()
eng.upper()

'KOREA COVID 19'

## Lists[]

In [58]:
data=[]

In [63]:
data.append('java')
data

['java', 'java']

In [19]:
data[0],data[-1],data[1:],data[:2]

('java', 'java', ['java'], ['java', 'java'])

In [61]:
data.sort()
data

['java']

In [203]:
data.reverse()
data

['java', 'java']

In [205]:
a='나무위키 꺼라'
a[2:]

'위키 꺼라'

## Tuple
### 튜플은 변동이 안된다.

In [66]:
b=(1,2,3,'사','오')
c=1,2,3
c

(1, 2, 3)

In [25]:
type(b),type(c)

(tuple, tuple)

In [71]:
b[3]=4

TypeError: 'tuple' object does not support item assignment

In [31]:
b[3:],b[1:4]

(('사', '오'), (2, 3, '사'))

## Dictionay {}

In [72]:
dic={'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}
dic

{'name1': '경민', '학번1': 20103, 'name2': '경민2', '학번2': 20104}

In [33]:
dic.get('name1')

'경민'

In [34]:
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [35]:
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

## set {}

In [56]:
lunch={'햄버거','치킨','라면','콜라',10000}
lunch & dinner

{10000, '라면', '콜라'}

In [206]:
dinner={'피자','족발','라면','콜라',10000}
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

## Pandas

In [207]:
import pandas as pd

In [209]:
li=[1,2,3]
li

[1, 2, 3]

In [210]:
type(li)

list

In [225]:
s1=pd.core.series.Series(li)
s1

0    1
1    2
2    3
dtype: int64

In [226]:
s2=pd.core.series.Series(['일','이','삼'])
s2

0    일
1    이
2    삼
dtype: object

In [224]:
data=dict(num=s1,word=s2)
data

{'num': 0    1
 1    2
 2    3
 dtype: int64, 'word': 0    일
 1    이
 2    삼
 dtype: object}

In [257]:
pd.DataFrame(data)

   num word
0    1    일
1    2    이
2    3    삼

In [272]:
pd.DataFrame([['a',100],['b',200],['c',300]])

   0    1
0  a  100
1  b  200
2  c  300

In [273]:
data = pd.DataFrame([['a',100],['b',200],['c',300]])

In [274]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [278]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [279]:
data.head(2)

   0    1
0  a  100
1  b  200

In [283]:
col=['1군','2군']

In [292]:
pd.DataFrame(([['a',100],['b',200],['c',300]]),columns=col)

  1군   2군
0  a  100
1  b  200
2  c  300

In [324]:
man=[{'Name':'은주','Age':20,'Job':'J1'},{'Name':'소주','Age':21,'Job':'J2'},{'Name':'대주','Age':22,'Job':'J2'},]
pd.DataFrame(man,index=[1,2,3])

  Name  Age Job
1   은주   20  J1
2   소주   21  J2
3   대주   22  J2

In [327]:
a=[1,2,3]
b=[4,5,6]
df=[a,b]
dd=pd.DataFrame(df,index=[1,2],columns=['A','B','C'])
dd

   0  1  2
0  1  2  3
1  4  5  6